In [2]:
#Hans Walter 20180006
#Cargar las librerías básicas, además el archivo csv que estaremos utilizando
import numpy as np
import pandas as pd
heroes = pd.read_csv("heroes_information.csv")

In [3]:
###instalar desde anaconda navigator######
from pandasql import *

In [4]:
pysqldf = lambda q: sqldf(q,globals())

In [5]:
query2 = " SELECT * FROM heroes limit 10"

In [6]:
pysqldf(query2)

,id,name,Gender,Eye color,Race,Hair color,Height,Publisher,Skin color,Alignment,Weight
0,0,A-Bomb,Male,yellow,Human,No Hair,203.0,Marvel Comics,None,good,441.0
1,1,Abe Sapien,Male,blue,Icthyo Sapien,No Hair,191.0,Dark Horse Comics,blue,good,65.0
2,2,Abin Sur,Male,blue,Ungaran,No Hair,185.0,DC Comics,red,good,90.0
3,3,Abomination,Male,green,Human / Radiation,No Hair,203.0,Marvel Comics,None,bad,441.0
4,4,Abraxas,Male,blue,Cosmic Entity,Black,-99.0,Marvel Comics,None,bad,-99.0
5,5,Absorbing Man,Male,blue,Human,No Hair,193.0,Marvel Comics,None,bad,122.0
6,6,Adam Monroe,Male,blue,None,Blond,-99.0,NBC - Heroes,None,good,-99.0
7,7,Adam Strange,Male,blue,Human,Blond,185.0,DC Comics,None,good,88.0
8,8,Agent 13,Female,blue,None,Blond,173.0,Marvel Comics,None,good,61.0
9,9,Agent Bob,Male,brown,Human,Brown,178.0,Marvel Comics,None,good,81.0

In [7]:
#Pregunta 1
#Cuál es el nombre del primer superhéroe de la tabla heroes?
pregunta1 = "SELECT name FROM heroes limit 1 "
pysqldf(pregunta1)
#Respuesta: A-Bomb

     name
0  A-Bomb

In [8]:
#Pregunta 2
#Cuántas casas publicadoras existen?
pregunta2 = "SELECT COUNT(DISTINCT(Publisher)) AS '# de Publicadores' FROM heroes"
pysqldf(pregunta2)
#Resputesa: Existen 24 casas publicadoras

   # de Publicadores
0                 24

In [9]:
#Pregunta 3
#Cuántos superhéroes miden más de 2 metros (200 cms)
pregunta3 = "SELECT COUNT(Height) AS '# de Héroes' FROM heroes WHERE Height>200  "
pysqldf(pregunta3)
#Respuesta: Hay 59 superhéroes que miden más de 2 metros.

   # de Héroes
0           59

In [10]:
#Pregunta 4
#Cuántos superhéroes son humanos y miden más de 2 metros (200 cms)?
pregunta4 = "SELECT COUNT(*) AS '# de Humanos' FROM heroes WHERE (RACE='Human' AND Height>200) "
pysqldf(pregunta4)
#Respuesta: Hay 12 superhéroes humanos que miden más de 2 metros.

   # de Humanos
0            12

In [11]:
#Pregunta 5
#Cuántos superéhores pesan más de 100 lbs y menos de 200 lbs
pregunta5 = "SELECT COUNT(*) AS n FROM heroes WHERE Weight > 100 AND Weight <200"
pysqldf(pregunta5)
#Respuesta: Hay 98 superhéroes que pesán entre 100 y 200 libras.

    n
0  98

In [12]:
#Pregunta 6
#Cuántos superhéroes tienen los ojos de color azul o rojo?
pregunta6 = "SELECT COUNT(*) AS n FROM heroes WHERE (`Eye color` = 'Blue' OR `Hair color` = 'Red')"
pysqldf(pregunta6)
#Respuesta: Hay 51 superhéroes con ojos de color azul o rojo.

    n
0  51

In [19]:
#Pregunta 7
#Cuántos superhéroes son Human, Mutant y tienen el pelo color Verde o son Vampiros con pelo Negro
pregunta7 = "SELECT COUNT(*) AS n FROM heroes WHERE ((RACE = 'Human' OR RACE = 'Mutant') AND [Hair color] = 'Green') OR (RACE = 'Vampire' AND [Hair color] = 'Black')"
pysqldf(pregunta7)
#Respuesta: 5 superhéroes cumplen con las condiciones de la pregunta.

   n
0  5

In [14]:
#Pregunta 8
#Cuál es el nombre del primer superhéroe si ordeno la tabla por raza en orden descendente?
pregunta8 = "SELECT name FROM heroes ORDER BY Race DESC limit 1" 
pysqldf(pregunta8)
#Respuesta: Solomon Grundy

             name
0  Solomon Grundy

In [15]:
#Pregunta 9
#Cuántos superhéroes son de género masculino y cuántas de género femenino?
pregunta9 = "SELECT Gender, Count(*) FROM heroes GROUP BY Gender"
pysqldf(pregunta9)
#Respuesta: Hay 505 de género masculino y 200 de género femenino.

   Gender  Count(*)
0    None        29
1  Female       200
2    Male       505

In [16]:
#Pregunta 10
#Cuántas casas publicadoras tienen más de 15 superhéroes
pregunta10 = "SELECT Publisher, COUNT(*) FROM heroes GROUP BY Publisher HAVING COUNT(*) > 15"
pysqldf(pregunta10)
#Respuesta: Hay 4 casas publicadoras con más de 15 superhéroes.

           Publisher  COUNT(*)
0          DC Comics       215
1  Dark Horse Comics        18
2      Marvel Comics       388
3       NBC - Heroes        19